app/views/shared/_order_items.html.haml

SELECT "shoppe_order_items".* FROM "shoppe_order_items" WHERE "shoppe_order_items"."order_id" = ?  [["order_id", 11]]
---
%table.orderItems