app/controllers/orders_controller.rb

  def remove_item
    item = current_order.order_items.find(params[:order_item_id])
    if current_order.order_items.count == 1
---
SELECT "shoppe_order_items".* FROM "shoppe_order_items" WHERE "shoppe_order_items"."order_id" IN (11)
SELECT COUNT(*) FROM "shoppe_order_items" WHERE "shoppe_order_items"."order_id" = ?  [["order_id", 11]]