app/controllers/products_controller.rb

SELECT "shoppe_product_categories".* FROM "shoppe_product_categories" WHERE "shoppe_product_categories"."id" IN (2)
---
  def index
    @products = @product_category.products.includes(:product_categories, :variants).root.active

SELECT "shoppe_order_items".* FROM "shoppe_order_items" WHERE "shoppe_order_items"."order_id" = ?  [["order_id", 11]]
---
  def add_to_basket
    product_to_order = params[:variant] ? @product.variants.find(params[:variant].to_i) : @product
    current_order.order_items.add_item(product_to_order, params[:quantity].blank? ? 1 : params[:quantity].to_i)